{
  "settings": {},
  "dependencies": [
    "3568BC9742092FC5"
  ],
  "tasks": {
    "315F143FB070D17F": {
      "title": "The Cleanroom",
      "type": "heracles:check"
    }
  },
  "rewards": {},
  "display": {
    "title": "All About the Cleanroom",
    "description": [
      "<task task=\"315F143FB070D17F\" quest=\"1E5EFC5880605DD4\"/>",
      "<hr/>",
      "First off, be sure to check the &&9tooltip&&r - there's a lot of information in there!",
      "<br/>",
      "Don't forget the &&3Maintenance Hatch&&r. If the structure refuses to form, rotate or replace the Controller, it can be a bit finicky. Don't worry - it doesn't have to be cube-shaped.",
      "<br/>",
      "The Controller always has to be in the center. The rest of the top layer has to be &&dFilter Casings&&r.",
      "<br/>",
      "All edges have to be &&dPlascrete&&r, and the sides can be &&dCleanroom Glass&&r.",
      "<br/>",
      "Placing &&3Generators&&r or &&3Mufflers&&r inside is &&cnot allowed&&r. They're too dirty, so the Cleanroom will unform.",
      "<br/>",
      "Upon assembly, the Cleanroom starts &&4contaminated&&r. While contamined, contained machines will not be able to operate.",
      "<br/>",
      "The Cleanroom will drain 30 EU/t and slowly increase the cleanliness until its cleanliness is at 100%.",
      "<br/>",
      "Once &&9Clean&&r, recipes can run. At that point it will only draw 4EU/t. Keep it powered at all times or it will get dirty again!",
      "<br/>",
      "The bigger the Cleanroom, the longer it takes to become Clean.",
      "<br/>",
      "&&9Note&&r: When the time comes, Multiblocks must also be put into Cleanrooms in order to run cleanroom recipes!",
      "<br/>",
      "Need to transfer EU? Try using &&3Hulls&&r or &&3Diodes&&r.",
      "<br/>",
      "Item and Fluid transfer can be done using &&3Passthrough Hatches&&r.",
      "<br/>",
      "&&3Machine Hulls&&r can also \"double\" as &&6ME Cables&&r to extend your ME Network inside your Cleanroom.",
      "<br/>",
      "If you used any &&dDoor(s)&&r in the structure, they can remain open. Not very realistic, but convenient!",
      "<br/>",
      "&&9&&eConfigs:&&r If you dislike the Cleanroom mechanics, it can be toggled off in the config file with &&5\"B:enableCleanroom\"&&r. Multiblocks can be made to ignore cleanroom requirements with &&5\"B:cleanMultiblocks\"&&r. We encourage you to try it out before deciding.",
      "<br/>",
      "In the real world, a Cleanroom is a well-isolated room which maintains a very low concentration of dust and airborne particles. They're normally used for scientific research, and in real-life semiconductor manufacturing. Clean rooms are specifically designed to keep out as many airborne particulates as can be. ",
      "<br/>",
      "Clean rooms are also sometimes used with the purpose of preventing materials from escaping! This is often the primary aim in fields such as pharmaceutics, nuclear work, and hazardous biology.",
      "<br/>",
      "The more you know!"
    ],
    "icon": {
      "type": "heracles:item",
      "item": "gtceu:cleanroom"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/rounded_squares.png",
    "groups": {
      "Tips and Tricks": {
        "position": [
          0,
          63
        ]
      }
    }
  }
}