{
  "settings": {},
  "tasks": {
    "04CC2E592A648F06": {
      "title": "I have read this page multiple times",
      "type": "heracles:check"
    }
  },
  "rewards": {},
  "display": {
    "title": "Important Information",
    "description": [
      "<subtitle id=\"13E9DF7E980CFC5B\" bold=\"true\" centered=\"true\" color=\"lightgray\"/>",
      "<hr/>",
      "<task task=\"04CC2E592A648F06\" quest=\"13E9DF7E980CFC5B\"/>",
      "<hr/>",
      "Be sure to &&aproperly&&r read &&lthis&&r quest - it has some &&dimportant information&&r that will remain relevant all throughout your playthrough.",
      "<br/>",
      "Informative quests such as this will appear in the chapter they are unlocked. You can also consult the &&b\"Guides + More\"&&r quest tab if you feel like you're forgetting something.",
      "<br/>",
      "The quest structure is intended to guide you through all the major milestones in &&aGregTech&&r progression. Every single quest should be &&2beneficial&&r to look at in some way - if something is 100% optional, we'll mention it, so don't worry about missing anything crucial.",
      "<br/>",
      "There are no drawbacks to playing this modpack in &&dPeaceful&&r - in fact, we highly urge you to do so, as there is little benefit from hostile mobs. Feel free to also to use &&o/keepInventory&&r, &&o/sethome&&r, and abuse minimap teleport as you see fit.",
      "<br/>",
      "Although we won't force these settings onto you, we &&4don't&&r intend for this modpack to provide a punishing &&eSurvival&&r experience, but more so help you learn the ins and outs of &&aGregTech CEu&&r.",
      "<br/>",
      "Lastly, it's good to be &&lsavvy&&r with &&eEMI.&&r &&aGregTech&&r items will frequently have several recipes, so you should never assume the first recipe &&eEMI&&r displays is the most efficient. \"Professional\" &&eEMI&&r usage involves the &&bidentification of patterns&&r in autogenerated recipes (example: all the Iron related items &&6macerate&&r into Iron Dust).",
      "<br/>",
      "When complex recipes arise - and we won't sugarcoat, &&aGTCEu&&r can be intimidating - we'll make sure to direct you towards the more &&5efficient routes&&r. However, we urge you to experiment on your own. It's no fun to follow the quest book by rote, right?"
    ],
    "icon": {
      "type": "heracles:item",
      "item": "heracles:quest_book"
    },
    "icon_background": "heracles:textures/gui/quest_backgrounds/circles.png",
    "subtitle": {
      "text": "Read this, and read it again!"
    },
    "groups": {
      "Introduction": {
        "position": [
          -72,
          -48
        ]
      }
    }
  }
}